# Запит номера дня тижня від користувача
номер_дня = int(input("Введіть номер дня тижня (1-7): "))

# Створення словника, де ключами будуть номери днів тижня, а значеннями - назви днів
дні_тижня = {
    1: "понеділок",
    2: "вівторок",
    3: "середа",
    4: "четвер",
    5: "п'ятниця",
    6: "субота",
    7: "неділя"
}

# Перевірка, чи введений номер входить в діапазон від 1 до 7
if 1 <= номер_дня <= 7:
    # Виведення назви дня тижня на екран
    print("Назва дня тижня:", дні_тижня[номер_дня])
else:
    print("Невірно введений номер дня тижня. Введіть число від 1 до 7.")
