# Запит номера місяця від користувача
номер_місяця = int(input("Введіть номер місяця (1-12): "))

# Створення списку з назвами місяців
місяці = [
    "січень",
    "лютий",
    "березень",
    "квітень",
    "травень",
    "червень",
    "липень",
    "серпень",
    "вересень",
    "жовтень",
    "листопад",
    "грудень"
]

# Перевірка, чи введений номер входить в діапазон від 1 до 12
if 1 <= номер_місяця <= 12:
    # Виведення назви місяця на екран
    print("Назва місяця:", місяці[номер_місяця - 1])
else:
    print("Невірно введений номер місяця. Введіть число від 1 до 12.")
